SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_frcif.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 FRCIF register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_FRCIF_H
#define EFR32FG25_FRCIF_H
#define FRCIF_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_FRCIF FRCIF
 * @{
 * @brief EFR32FG25 FRCIF Register Declaration.
 *****************************************************************************/

/** FRCIF Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  __IOM uint32_t CONNECT;                       /**< New Register                                       */
  __IOM uint32_t DISCLK;                        /**< Disable clk_per                                    */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN;                        /**< New Register                                       */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT;                       /**< New Register                                       */
  uint32_t       RESERVED2[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN;                         /**< New Register                                       */
  uint32_t       RESERVED3[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT;                        /**< New Register                                       */
  uint32_t       RESERVED4[79U];                /**< Reserved for future use                            */
  __IOM uint32_t TXCTRL;                        /**< New Register                                       */
  __IOM uint32_t RXCTRL;                        /**< New Register                                       */
  __IOM uint32_t IF;                            /**< New Register                                       */
  __IOM uint32_t IEN;                           /**< New Register                                       */
  __IOM uint32_t CTRL;                          /**< New Register                                       */
  uint32_t       RESERVED5[891U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_SET;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_SET;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_SET;                    /**< New Register                                       */
  uint32_t       RESERVED7[7U];                 /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_SET;                   /**< New Register                                       */
  uint32_t       RESERVED8[23U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_SET;                     /**< New Register                                       */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_SET;                    /**< New Register                                       */
  uint32_t       RESERVED10[79U];               /**< Reserved for future use                            */
  __IOM uint32_t TXCTRL_SET;                    /**< New Register                                       */
  __IOM uint32_t RXCTRL_SET;                    /**< New Register                                       */
  __IOM uint32_t IF_SET;                        /**< New Register                                       */
  __IOM uint32_t IEN_SET;                       /**< New Register                                       */
  __IOM uint32_t CTRL_SET;                      /**< New Register                                       */
  uint32_t       RESERVED11[891U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_CLR;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED12[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_CLR;                   /**< New Register                                       */
  uint32_t       RESERVED14[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_CLR;                     /**< New Register                                       */
  uint32_t       RESERVED15[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_CLR;                    /**< New Register                                       */
  uint32_t       RESERVED16[79U];               /**< Reserved for future use                            */
  __IOM uint32_t TXCTRL_CLR;                    /**< New Register                                       */
  __IOM uint32_t RXCTRL_CLR;                    /**< New Register                                       */
  __IOM uint32_t IF_CLR;                        /**< New Register                                       */
  __IOM uint32_t IEN_CLR;                       /**< New Register                                       */
  __IOM uint32_t CTRL_CLR;                      /**< New Register                                       */
  uint32_t       RESERVED17[891U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  __IOM uint32_t CONNECT_TGL;                   /**< New Register                                       */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED18[3U];                /**< Reserved for future use                            */
  __IOM uint32_t FIFOIN_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED19[7U];                /**< Reserved for future use                            */
  __IM uint32_t  FIFOOUT_TGL;                   /**< New Register                                       */
  uint32_t       RESERVED20[23U];               /**< Reserved for future use                            */
  __IOM uint32_t FMTIN_TGL;                     /**< New Register                                       */
  uint32_t       RESERVED21[7U];                /**< Reserved for future use                            */
  __IOM uint32_t FMTOUT_TGL;                    /**< New Register                                       */
  uint32_t       RESERVED22[79U];               /**< Reserved for future use                            */
  __IOM uint32_t TXCTRL_TGL;                    /**< New Register                                       */
  __IOM uint32_t RXCTRL_TGL;                    /**< New Register                                       */
  __IOM uint32_t IF_TGL;                        /**< New Register                                       */
  __IOM uint32_t IEN_TGL;                       /**< New Register                                       */
  __IOM uint32_t CTRL_TGL;                      /**< New Register                                       */
} FRCIF_TypeDef;
/** @} End of group EFR32FG25_FRCIF */

/**************************************************************************//**
 * @addtogroup EFR32FG25_FRCIF
 * @{
 * @defgroup EFR32FG25_FRCIF_BitFields FRCIF Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for FRCIF IPVERSION */
#define _FRCIF_IPVERSION_RESETVALUE           0x00000001UL                              /**< Default value for FRCIF_IPVERSION           */
#define _FRCIF_IPVERSION_MASK                 0xFFFFFFFFUL                              /**< Mask for FRCIF_IPVERSION                    */
#define _FRCIF_IPVERSION_IPVERSION_SHIFT      0                                         /**< Shift value for FRCIF_IPVERSION             */
#define _FRCIF_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                              /**< Bit mask for FRCIF_IPVERSION                */
#define _FRCIF_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                              /**< Mode DEFAULT for FRCIF_IPVERSION            */
#define FRCIF_IPVERSION_IPVERSION_DEFAULT     (_FRCIF_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for FRCIF_IPVERSION    */

