SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_frcif.h
/* Bit fields for FRCIF EN */
#define _FRCIF_EN_RESETVALUE                  0x00000000UL                              /**< Default value for FRCIF_EN                  */
#define _FRCIF_EN_MASK                        0x00000003UL                              /**< Mask for FRCIF_EN                           */
#define FRCIF_EN_EN                           (0x1UL << 0)                              /**< Module Enable                               */
#define _FRCIF_EN_EN_SHIFT                    0                                         /**< Shift value for FRCIF_EN                    */
#define _FRCIF_EN_EN_MASK                     0x1UL                                     /**< Bit mask for FRCIF_EN                       */
#define _FRCIF_EN_EN_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for FRCIF_EN                   */
#define FRCIF_EN_EN_DEFAULT                   (_FRCIF_EN_EN_DEFAULT << 0)               /**< Shifted mode DEFAULT for FRCIF_EN           */
#define FRCIF_EN_DISABLING                    (0x1UL << 1)                              /**< Disablement Busy Status                     */
#define _FRCIF_EN_DISABLING_SHIFT             1                                         /**< Shift value for FRCIF_DISABLING             */
#define _FRCIF_EN_DISABLING_MASK              0x2UL                                     /**< Bit mask for FRCIF_DISABLING                */
#define _FRCIF_EN_DISABLING_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for FRCIF_EN                   */
#define FRCIF_EN_DISABLING_DEFAULT            (_FRCIF_EN_DISABLING_DEFAULT << 1)        /**< Shifted mode DEFAULT for FRCIF_EN           */

/* Bit fields for FRCIF SWRST */
#define _FRCIF_SWRST_RESETVALUE               0x00000000UL                              /**< Default value for FRCIF_SWRST               */
#define _FRCIF_SWRST_MASK                     0x00000003UL                              /**< Mask for FRCIF_SWRST                        */
#define FRCIF_SWRST_SWRST                     (0x1UL << 0)                              /**< Software Reset Command                      */
#define _FRCIF_SWRST_SWRST_SHIFT              0                                         /**< Shift value for FRCIF_SWRST                 */
#define _FRCIF_SWRST_SWRST_MASK               0x1UL                                     /**< Bit mask for FRCIF_SWRST                    */
#define _FRCIF_SWRST_SWRST_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for FRCIF_SWRST                */
#define FRCIF_SWRST_SWRST_DEFAULT             (_FRCIF_SWRST_SWRST_DEFAULT << 0)         /**< Shifted mode DEFAULT for FRCIF_SWRST        */
#define FRCIF_SWRST_RESETTING                 (0x1UL << 1)                              /**< Software Reset Busy Status                  */
#define _FRCIF_SWRST_RESETTING_SHIFT          1                                         /**< Shift value for FRCIF_RESETTING             */
#define _FRCIF_SWRST_RESETTING_MASK           0x2UL                                     /**< Bit mask for FRCIF_RESETTING                */
#define _FRCIF_SWRST_RESETTING_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for FRCIF_SWRST                */
#define FRCIF_SWRST_RESETTING_DEFAULT         (_FRCIF_SWRST_RESETTING_DEFAULT << 1)     /**< Shifted mode DEFAULT for FRCIF_SWRST        */

/* Bit fields for FRCIF CONNECT */
#define _FRCIF_CONNECT_RESETVALUE             0x00000000UL                              /**< Default value for FRCIF_CONNECT             */
#define _FRCIF_CONNECT_MASK                   0x00000101UL                              /**< Mask for FRCIF_CONNECT                      */
#define FRCIF_CONNECT_IN                      (0x1UL << 0)                              /**< Input FIFO connect                          */
#define _FRCIF_CONNECT_IN_SHIFT               0                                         /**< Shift value for FRCIF_IN                    */
#define _FRCIF_CONNECT_IN_MASK                0x1UL                                     /**< Bit mask for FRCIF_IN                       */
#define _FRCIF_CONNECT_IN_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for FRCIF_CONNECT              */
#define FRCIF_CONNECT_IN_DEFAULT              (_FRCIF_CONNECT_IN_DEFAULT << 0)          /**< Shifted mode DEFAULT for FRCIF_CONNECT      */
#define FRCIF_CONNECT_OUT                     (0x1UL << 8)                              /**< Output FIFO connect                         */
#define _FRCIF_CONNECT_OUT_SHIFT              8                                         /**< Shift value for FRCIF_OUT                   */
#define _FRCIF_CONNECT_OUT_MASK               0x100UL                                   /**< Bit mask for FRCIF_OUT                      */
#define _FRCIF_CONNECT_OUT_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for FRCIF_CONNECT              */
#define FRCIF_CONNECT_OUT_DEFAULT             (_FRCIF_CONNECT_OUT_DEFAULT << 8)         /**< Shifted mode DEFAULT for FRCIF_CONNECT      */

/* Bit fields for FRCIF DISCLK */
#define _FRCIF_DISCLK_RESETVALUE              0x00000000UL                              /**< Default value for FRCIF_DISCLK              */
#define _FRCIF_DISCLK_MASK                    0x00000003UL                              /**< Mask for FRCIF_DISCLK                       */
#define _FRCIF_DISCLK_DISCLK_SHIFT            0                                         /**< Shift value for FRCIF_DISCLK                */
#define _FRCIF_DISCLK_DISCLK_MASK             0x3UL                                     /**< Bit mask for FRCIF_DISCLK                   */
#define _FRCIF_DISCLK_DISCLK_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for FRCIF_DISCLK               */
#define _FRCIF_DISCLK_DISCLK_NONE             0x00000000UL                              /**< Mode NONE for FRCIF_DISCLK                  */
#define _FRCIF_DISCLK_DISCLK_ALL              0x00000001UL                              /**< Mode ALL for FRCIF_DISCLK                   */
#define _FRCIF_DISCLK_DISCLK_AUTO             0x00000002UL                              /**< Mode AUTO for FRCIF_DISCLK                  */
#define FRCIF_DISCLK_DISCLK_DEFAULT           (_FRCIF_DISCLK_DISCLK_DEFAULT << 0)       /**< Shifted mode DEFAULT for FRCIF_DISCLK       */
#define FRCIF_DISCLK_DISCLK_NONE              (_FRCIF_DISCLK_DISCLK_NONE << 0)          /**< Shifted mode NONE for FRCIF_DISCLK          */
#define FRCIF_DISCLK_DISCLK_ALL               (_FRCIF_DISCLK_DISCLK_ALL << 0)           /**< Shifted mode ALL for FRCIF_DISCLK           */
#define FRCIF_DISCLK_DISCLK_AUTO              (_FRCIF_DISCLK_DISCLK_AUTO << 0)          /**< Shifted mode AUTO for FRCIF_DISCLK          */

