SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_frcif.h
/* Bit fields for FRCIF FIFOIN */
#define _FRCIF_FIFOIN_RESETVALUE              0x00000000UL                              /**< Default value for FRCIF_FIFOIN              */
#define _FRCIF_FIFOIN_MASK                    0x1FFF3F0FUL                              /**< Mask for FRCIF_FIFOIN                       */
#define _FRCIF_FIFOIN_FID_SHIFT               0                                         /**< Shift value for FRCIF_FID                   */
#define _FRCIF_FIFOIN_FID_MASK                0xFUL                                     /**< Bit mask for FRCIF_FID                      */
#define _FRCIF_FIFOIN_FID_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOIN               */
#define FRCIF_FIFOIN_FID_DEFAULT              (_FRCIF_FIFOIN_FID_DEFAULT << 0)          /**< Shifted mode DEFAULT for FRCIF_FIFOIN       */
#define _FRCIF_FIFOIN_CID_SHIFT               8                                         /**< Shift value for FRCIF_CID                   */
#define _FRCIF_FIFOIN_CID_MASK                0x3F00UL                                  /**< Bit mask for FRCIF_CID                      */
#define _FRCIF_FIFOIN_CID_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOIN               */
#define FRCIF_FIFOIN_CID_DEFAULT              (_FRCIF_FIFOIN_CID_DEFAULT << 8)          /**< Shifted mode DEFAULT for FRCIF_FIFOIN       */
#define _FRCIF_FIFOIN_REM_SHIFT               16                                        /**< Shift value for FRCIF_REM                   */
#define _FRCIF_FIFOIN_REM_MASK                0xFF0000UL                                /**< Bit mask for FRCIF_REM                      */
#define _FRCIF_FIFOIN_REM_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOIN               */
#define FRCIF_FIFOIN_REM_DEFAULT              (_FRCIF_FIFOIN_REM_DEFAULT << 16)         /**< Shifted mode DEFAULT for FRCIF_FIFOIN       */
#define _FRCIF_FIFOIN_ALARM_SHIFT             24                                        /**< Shift value for FRCIF_ALARM                 */
#define _FRCIF_FIFOIN_ALARM_MASK              0x1F000000UL                              /**< Bit mask for FRCIF_ALARM                    */
#define _FRCIF_FIFOIN_ALARM_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOIN               */
#define FRCIF_FIFOIN_ALARM_DEFAULT            (_FRCIF_FIFOIN_ALARM_DEFAULT << 24)       /**< Shifted mode DEFAULT for FRCIF_FIFOIN       */

/* Bit fields for FRCIF FIFOOUT */
#define _FRCIF_FIFOOUT_RESETVALUE             0x00000000UL                              /**< Default value for FRCIF_FIFOOUT             */
#define _FRCIF_FIFOOUT_MASK                   0x1FFF0000UL                              /**< Mask for FRCIF_FIFOOUT                      */
#define _FRCIF_FIFOOUT_CNT_SHIFT              16                                        /**< Shift value for FRCIF_CNT                   */
#define _FRCIF_FIFOOUT_CNT_MASK               0xFF0000UL                                /**< Bit mask for FRCIF_CNT                      */
#define _FRCIF_FIFOOUT_CNT_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOOUT              */
#define FRCIF_FIFOOUT_CNT_DEFAULT             (_FRCIF_FIFOOUT_CNT_DEFAULT << 16)        /**< Shifted mode DEFAULT for FRCIF_FIFOOUT      */
#define _FRCIF_FIFOOUT_ALARM_SHIFT            24                                        /**< Shift value for FRCIF_ALARM                 */
#define _FRCIF_FIFOOUT_ALARM_MASK             0x1F000000UL                              /**< Bit mask for FRCIF_ALARM                    */
#define _FRCIF_FIFOOUT_ALARM_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for FRCIF_FIFOOUT              */
#define FRCIF_FIFOOUT_ALARM_DEFAULT           (_FRCIF_FIFOOUT_ALARM_DEFAULT << 24)      /**< Shifted mode DEFAULT for FRCIF_FIFOOUT      */

/* Bit fields for FRCIF FMTIN */
#define _FRCIF_FMTIN_RESETVALUE               0x0000001FUL                              /**< Default value for FRCIF_FMTIN               */
#define _FRCIF_FMTIN_MASK                     0x0000001FUL                              /**< Mask for FRCIF_FMTIN                        */
#define _FRCIF_FMTIN_ELEMSIZE_SHIFT           0                                         /**< Shift value for FRCIF_ELEMSIZE              */
#define _FRCIF_FMTIN_ELEMSIZE_MASK            0x1FUL                                    /**< Bit mask for FRCIF_ELEMSIZE                 */
#define _FRCIF_FMTIN_ELEMSIZE_DEFAULT         0x0000001FUL                              /**< Mode DEFAULT for FRCIF_FMTIN                */
#define FRCIF_FMTIN_ELEMSIZE_DEFAULT          (_FRCIF_FMTIN_ELEMSIZE_DEFAULT << 0)      /**< Shifted mode DEFAULT for FRCIF_FMTIN        */

/* Bit fields for FRCIF FMTOUT */
#define _FRCIF_FMTOUT_RESETVALUE              0x0000001FUL                              /**< Default value for FRCIF_FMTOUT              */
#define _FRCIF_FMTOUT_MASK                    0x0000001FUL                              /**< Mask for FRCIF_FMTOUT                       */
#define _FRCIF_FMTOUT_ELEMSIZE_SHIFT          0                                         /**< Shift value for FRCIF_ELEMSIZE              */
#define _FRCIF_FMTOUT_ELEMSIZE_MASK           0x1FUL                                    /**< Bit mask for FRCIF_ELEMSIZE                 */
#define _FRCIF_FMTOUT_ELEMSIZE_DEFAULT        0x0000001FUL                              /**< Mode DEFAULT for FRCIF_FMTOUT               */
#define FRCIF_FMTOUT_ELEMSIZE_DEFAULT         (_FRCIF_FMTOUT_ELEMSIZE_DEFAULT << 0)     /**< Shifted mode DEFAULT for FRCIF_FMTOUT       */

/* Bit fields for FRCIF TXCTRL */
#define _FRCIF_TXCTRL_RESETVALUE              0x00000000UL                              /**< Default value for FRCIF_TXCTRL              */
#define _FRCIF_TXCTRL_MASK                    0x0001FFFFUL                              /**< Mask for FRCIF_TXCTRL                       */
#define _FRCIF_TXCTRL_FRCTXREQNB_SHIFT        0                                         /**< Shift value for FRCIF_FRCTXREQNB            */
#define _FRCIF_TXCTRL_FRCTXREQNB_MASK         0xFFFFUL                                  /**< Bit mask for FRCIF_FRCTXREQNB               */
#define _FRCIF_TXCTRL_FRCTXREQNB_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for FRCIF_TXCTRL               */
#define FRCIF_TXCTRL_FRCTXREQNB_DEFAULT       (_FRCIF_TXCTRL_FRCTXREQNB_DEFAULT << 0)   /**< Shifted mode DEFAULT for FRCIF_TXCTRL       */
#define FRCIF_TXCTRL_STARTTX                  (0x1UL << 16)                             /**< New BitField                                */
#define _FRCIF_TXCTRL_STARTTX_SHIFT           16                                        /**< Shift value for FRCIF_STARTTX               */
#define _FRCIF_TXCTRL_STARTTX_MASK            0x10000UL                                 /**< Bit mask for FRCIF_STARTTX                  */
#define _FRCIF_TXCTRL_STARTTX_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for FRCIF_TXCTRL               */
#define FRCIF_TXCTRL_STARTTX_DEFAULT          (_FRCIF_TXCTRL_STARTTX_DEFAULT << 16)     /**< Shifted mode DEFAULT for FRCIF_TXCTRL       */

/* Bit fields for FRCIF RXCTRL */
#define _FRCIF_RXCTRL_RESETVALUE              0x00000000UL                              /**< Default value for FRCIF_RXCTRL              */
#define _FRCIF_RXCTRL_MASK                    0x0001FFFFUL                              /**< Mask for FRCIF_RXCTRL                       */
#define _FRCIF_RXCTRL_FRCRXREQNB_SHIFT        0                                         /**< Shift value for FRCIF_FRCRXREQNB            */
#define _FRCIF_RXCTRL_FRCRXREQNB_MASK         0xFFFFUL                                  /**< Bit mask for FRCIF_FRCRXREQNB               */
#define _FRCIF_RXCTRL_FRCRXREQNB_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for FRCIF_RXCTRL               */
#define FRCIF_RXCTRL_FRCRXREQNB_DEFAULT       (_FRCIF_RXCTRL_FRCRXREQNB_DEFAULT << 0)   /**< Shifted mode DEFAULT for FRCIF_RXCTRL       */
#define FRCIF_RXCTRL_STARTRX                  (0x1UL << 16)                             /**< New BitField                                */
#define _FRCIF_RXCTRL_STARTRX_SHIFT           16                                        /**< Shift value for FRCIF_STARTRX               */
#define _FRCIF_RXCTRL_STARTRX_MASK            0x10000UL                                 /**< Bit mask for FRCIF_STARTRX                  */
#define _FRCIF_RXCTRL_STARTRX_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for FRCIF_RXCTRL               */
#define FRCIF_RXCTRL_STARTRX_DEFAULT          (_FRCIF_RXCTRL_STARTRX_DEFAULT << 16)     /**< Shifted mode DEFAULT for FRCIF_RXCTRL       */

/* Bit fields for FRCIF IF */
#define _FRCIF_IF_RESETVALUE                  0x00000000UL                              /**< Default value for FRCIF_IF                  */
#define _FRCIF_IF_MASK                        0x00000003UL                              /**< Mask for FRCIF_IF                           */
#define FRCIF_IF_FRCIFIF0                     (0x1UL << 0)                              /**< FRCIF Interrupt flag                        */
#define _FRCIF_IF_FRCIFIF0_SHIFT              0                                         /**< Shift value for FRCIF_FRCIFIF0              */
#define _FRCIF_IF_FRCIFIF0_MASK               0x1UL                                     /**< Bit mask for FRCIF_FRCIFIF0                 */
#define _FRCIF_IF_FRCIFIF0_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for FRCIF_IF                   */
#define FRCIF_IF_FRCIFIF0_DEFAULT             (_FRCIF_IF_FRCIFIF0_DEFAULT << 0)         /**< Shifted mode DEFAULT for FRCIF_IF           */
#define FRCIF_IF_FRCIFIF1                     (0x1UL << 1)                              /**< FRCIF Interrupt flag                        */
#define _FRCIF_IF_FRCIFIF1_SHIFT              1                                         /**< Shift value for FRCIF_FRCIFIF1              */
#define _FRCIF_IF_FRCIFIF1_MASK               0x2UL                                     /**< Bit mask for FRCIF_FRCIFIF1                 */
#define _FRCIF_IF_FRCIFIF1_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for FRCIF_IF                   */
#define FRCIF_IF_FRCIFIF1_DEFAULT             (_FRCIF_IF_FRCIFIF1_DEFAULT << 1)         /**< Shifted mode DEFAULT for FRCIF_IF           */

/* Bit fields for FRCIF IEN */
#define _FRCIF_IEN_RESETVALUE                 0x00000000UL                              /**< Default value for FRCIF_IEN                 */
#define _FRCIF_IEN_MASK                       0x00000003UL                              /**< Mask for FRCIF_IEN                          */
#define FRCIF_IEN_FRCIFIEN0                   (0x1UL << 0)                              /**< FRCIF Interrupt Enable                      */
#define _FRCIF_IEN_FRCIFIEN0_SHIFT            0                                         /**< Shift value for FRCIF_FRCIFIEN0             */
#define _FRCIF_IEN_FRCIFIEN0_MASK             0x1UL                                     /**< Bit mask for FRCIF_FRCIFIEN0                */
#define _FRCIF_IEN_FRCIFIEN0_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for FRCIF_IEN                  */
#define FRCIF_IEN_FRCIFIEN0_DEFAULT           (_FRCIF_IEN_FRCIFIEN0_DEFAULT << 0)       /**< Shifted mode DEFAULT for FRCIF_IEN          */
#define FRCIF_IEN_FRCIFIEN1                   (0x1UL << 1)                              /**< FRCIF Interrupt Enable                      */
#define _FRCIF_IEN_FRCIFIEN1_SHIFT            1                                         /**< Shift value for FRCIF_FRCIFIEN1             */
#define _FRCIF_IEN_FRCIFIEN1_MASK             0x2UL                                     /**< Bit mask for FRCIF_FRCIFIEN1                */
#define _FRCIF_IEN_FRCIFIEN1_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for FRCIF_IEN                  */
#define FRCIF_IEN_FRCIFIEN1_DEFAULT           (_FRCIF_IEN_FRCIFIEN1_DEFAULT << 1)       /**< Shifted mode DEFAULT for FRCIF_IEN          */

/* Bit fields for FRCIF CTRL */
#define _FRCIF_CTRL_RESETVALUE                0x00000000UL                              /**< Default value for FRCIF_CTRL                */
#define _FRCIF_CTRL_MASK                      0x00000001UL                              /**< Mask for FRCIF_CTRL                         */
#define FRCIF_CTRL_DISCLKMODE                 (0x1UL << 0)                              /**< New BitField                                */
#define _FRCIF_CTRL_DISCLKMODE_SHIFT          0                                         /**< Shift value for FRCIF_DISCLKMODE            */
#define _FRCIF_CTRL_DISCLKMODE_MASK           0x1UL                                     /**< Bit mask for FRCIF_DISCLKMODE               */
#define _FRCIF_CTRL_DISCLKMODE_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for FRCIF_CTRL                 */
#define FRCIF_CTRL_DISCLKMODE_DEFAULT         (_FRCIF_CTRL_DISCLKMODE_DEFAULT << 0)     /**< Shifted mode DEFAULT for FRCIF_CTRL         */

/** @} End of group EFR32FG25_FRCIF_BitFields */
/** @} End of group EFR32FG25_FRCIF */
/** @} End of group Parts */

#endif /* EFR32FG25_FRCIF_H */
